Revit 2024 API
BuiltInFailures.SketchFailures.RunNotEnoughBoundaryCurves Property
 Sketch run require boundaries (chains of one or more Boundary Lines)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RunNotEnoughBoundaryCurves { get; }
Visual Basic
Public Shared ReadOnly Property RunNotEnoughBoundaryCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RunNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace